tests/fixturesSource/find_user_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://tempuri.org/">
    <SOAP-ENV:Body>
        <ns1:FindUser>
            <ns1:User>test@acg.com</ns1:User>
        </ns1:FindUser>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>